import api
from random import shuffle

taglist = ["تدوینگر", "ادیت_فیلم", "ویرایش_فیلم", "تدوین", "ادیت_ویدئو",
           "پریمیر", "ادیت", "لوگوموشن", "موشنگرافیک"]
commentlist = [
    "بسیار عالی، اگر دوست داشتید از پیج من هم دیدن کنید ",
    "تدوین و ادیت ویدئو با قیمت مناسب و کیفیت بالا ",
    "با اجازه سیو میکنم پستتون رو؛ اگه دوس داشتین از پیج من هم دیدن کنید",
    "جالب بود. خوشحال میشم پیج من رو هم دیدن کنید",
    "کارتون واقعا عالیه، خوشحال میشم پیج من رو هم ببینید"
]
taglist2 = ["تکنولوژی", "شبکه", "ساخت_سایت", "آموزش_طراحی_سایت", "توسعه_وب",
            "انتخاب_دامنه", "دامنه_سایت", "برنامه_نویسی", "طراحی_سایت", "وردپرس","لینوکس"]

commentlist2 = [
    "طراحی سایت با قیمت مناسب و کیفیت بالا ",
    "با اجازه سیو میکنم پستتون رو؛ اگه دوس داشتین از پیج من هم دیدن کنید",
    "جالب بود. خوشحال میشم پیج من رو هم دیدن کنید"
    ,"سلام پیج عالی دارین. ما هم توی پیجمون مطالب مشابهی داریم .خوشحال میشیم به ماهم سر بزنید و اگر دوست داشتین مارو دنبال کنین",
    "اگه دوست داری بدونی که اینترنت چطور کار میکنه پست دومم رو ببین",
    "دوس داری با نحوه کارکرد سایت ها و وب آشنا بشی؟ پست دومم رو ببین",
    "بسیار عالی، لطفا پیج من رو هم ببینین ",
    "لذت بردیم مهندس 👏👏",
    "مختصر و مفید 👏👏",
    "طراحی سایت با قیمت مناسب",
    "ساخت بات تلگرام و ایسنتاگرام با قیمت مناسب",
    "مفید بود 👏👏"
]


def main():
    
    api.login("test_sele","sele_Admin")
    
    shuffle(taglist2)
    for tag in taglist2:
        api.findSimilar(tag)
    # api.follow()
    for tag in api.tags:
        taglist2.append(tag)
    shuffle(taglist2)
    counter = 0
    for tag in taglist2:
        if counter < 10:
            api.setTag(tag)   
            api.getPosts()
            counter += 1
    # api.likePosts()
    # api.commentPosts(commentlist)
    api.cmAndLike(commentlist2)


if __name__ == '__main__':
    main()
