import api
from random import shuffle

commentlist = [
    "طراحی سایت با قیمت مناسب و کیفیت بالا ",
    "با اجازه سیو میکنم پستتون رو؛ اگه دوس داشتین از پیج من هم دیدن کنید",
    "جالب بود. خوشحال میشم پیج من رو هم دیدن کنید"
    ,"سلام پیج عالی دارین. ما هم توی پیجمون مطالب مشابهی داریم .خوشحال میشیم به ماهم سر بزنید و اگر دوست داشتین مارو دنبال کنین",
    "اگه دوست داری بدونی که دامنه سایت چطور کار میکنه پست آخرم رو ببین",
    "اگه دوست داری بدونی که اینترنت چطور کار میکنه پست آخرم رو ببین",
    "دوس داری با نحوه کارکرد سایت ها و وب آشنا بشی؟ پست آخرم رو ببین",
    "میدونی فرق بین دامین ir و com چیه؟ پست آخرم رو ببین"
]
taglist = ["تکنولوژی", "شبکه", "ساخت_سایت", "آموزش_طراحی_سایت", "توسعه_وب",
            "انتخاب_دامنه", "دامنه_سایت", "برنامه_نویسی", "طراحی_سایت", "وردپرس"]

def main():
    # api.login("dayan_video", "sem1384sem")
    api.login("rayanweb_","llasusetahdog")
    for tag in taglist:
        api.findSimilar(tag)
    api.follow()
    api.cmAndLike(commentlist)


if __name__ == '__main__':
    main()
